# Используем легковесный официальный образ Python
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем сначала только requirements, чтобы кэшировать установку библиотек
COPY requirements.txt .

# Устанавливаем библиотеки без сохранения лишнего кэша
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы (включая bot.py)
COPY . .

# Запускаем бота (-u нужен, чтобы логи сразу выводились в консоль докера)
CMD ["python", "-u", "bot.py"]